app/views/artists/show.html.slim

div
    -@artist.albums.each do |album|
---
SELECT "albums".* FROM "albums" WHERE "albums"."artist_id" = ?  [["artist_id", 1]]