app/views/songs/_form.html.slim

SELECT "albums".* FROM "albums"
---
        =form.label :Album
        =form.select :album_id, Album.all.collect { |album| [album.title, album.id] }, include_blank: true