app/views/songs/show.html.slim

h3
    -if @song.rating.present?
---
SELECT "ratings".* FROM "ratings" WHERE "ratings"."song_id" = ? LIMIT ?  [["song_id", 4], ["LIMIT", 1]]