app/views/ratings/_form.html.slim

        =form.text_field :evaluation
        - @song.rating.errors.full_messages_for(:evaluation).each do |message|
---
SELECT "ratings".* FROM "ratings" WHERE "ratings"."song_id" = ? LIMIT ?  [["song_id", 4], ["LIMIT", 1]]