app/views/albums/_form.html.slim

SELECT "artists".* FROM "artists"
---
        =form.label :Artist
        =form.select :artist_id, Artist.all.collect { |artist| [artist.name, artist.id] }, include_blank: true