app/views/albums/show.html.slim

SELECT "songs".* FROM "songs" WHERE "songs"."album_id" = ?  [["album_id", 1]]
---
h2
    -@album.songs.each do |song|