app/controllers/albums_controller.rb

  def index
    @albums = Album.all
---
SELECT "albums".* FROM "albums" LIMIT ?  [["LIMIT", 1]]

  def create
    @album = Album.new(album_params)

    if @album.save
---
INSERT INTO "albums" ("artist_id", "title", "genre", "release", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["artist_id", 2], ["title", "Greatest Hits "], ["genre", "Metal"], ["release", 2008], ["created_at", "2022-09-19 13:23:43.355488"], ["updated_at", "2022-09-19 13:23:43.355488"]]

  def update
    @album = Album.find(params[:id])
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  def destroy
    @album = Artist.find(params[:id]).albums.find(params[:id])
    @album.destroy
---
SELECT "albums".* FROM "albums" WHERE "albums"."artist_id" = ? AND "albums"."id" = ? LIMIT ?  [["artist_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = ?  [["id", 1]]

  def genre_sort
    if params[:search_by_genre] && params[:search_by_genre] != ""
      @songs = Song.joins(:album).where("genre LIKE ?", params[:search_by_genre]).joins(:rating).order("ratings.evaluation DESC")
---
SELECT "songs".* FROM "songs" INNER JOIN "albums" ON "albums"."id" = "songs"."album_id" INNER JOIN "ratings" ON "ratings"."song_id" = "songs"."id" WHERE (genre LIKE 'Metal') ORDER BY ratings.evaluation DESC

  def year_sort
    if params[:search_by_year] && params[:search_by_year] != ""
      @songs = Song.joins(:album).where("release LIKE ?", params[:search_by_year])
---
SELECT "albums".* FROM "albums" INNER JOIN "songs" ON "songs"."album_id" = "albums"."id" WHERE (album.release LIKE NULL)
SELECT "songs".* FROM "songs" INNER JOIN "albums" ON "albums"."id" = "songs"."album_id" WHERE (album.release LIKE NULL)