app/controllers/artists_controller.rb

  def create
    @artist = Artist.new(artist_params)

    if @artist.save
---
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Rihanna"], ["created_at", "2022-09-16 14:07:21.267735"], ["updated_at", "2022-09-16 14:07:21.267735"]]

  def edit
    @artist = Artist.find(params[:id])
---
SELECT "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def update
    @artist = Artist.find(params[:id])
---
SELECT "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def destroy
    @artist = Artist.find(params[:id])
    @artist.destroy
---
SELECT "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "artists" WHERE "artists"."id" = ?  [["id", 1]]