app/controllers/ratings_controller.rb

SELECT "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "ratings" ("song_id", "evaluation", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["song_id", 5], ["evaluation", 99], ["created_at", "2022-09-20 09:03:02.098999"], ["updated_at", "2022-09-20 09:03:02.098999"]]
---
  def create
    @song = Song.find(params[:song_id])
    @rating = @song.create_rating!(rating_params)