app/controllers/songs_controller.rb

  def create
    @song = Song.new(song_params)

    if @song.save
---
INSERT INTO "songs" ("album_id", "subject", "rhythm", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["album_id", 1], ["subject", "This is a song "], ["rhythm", 2], ["created_at", "2022-09-20 07:30:56.671246"], ["updated_at", "2022-09-20 07:30:56.671246"]]